In [1]:
import numpy as np
import pandas as pd

In [2]:
indexes = ['Iran','b','c']
list_py = [10,20,30]
dic = {'a':10 , 'b':20 , 'c':30}

In [3]:
sample = pd.Series(list_py,indexes)

In [4]:
sample

Iran    10
b       20
c       30
dtype: int64

In [5]:
covid19_data = pd.Series(data = [2000,400,1220,587,54789], index = ['Iran' , 'Usa' , 'India' , 'China' , 'France'])

In [6]:
covid19_data * 2

Iran        4000
Usa          800
India       2440
China       1174
France    109578
dtype: int64

In [7]:
covid19_data + sample

China        NaN
France       NaN
India        NaN
Iran      2010.0
Usa          NaN
b            NaN
c            NaN
dtype: float64

In [8]:
columns = ['Q','W','E','R','T']

In [9]:
index = ['A','B','C','D']

In [10]:
data = np.random.randint(-100 , 100 ,  (4,5))

In [11]:
data

array([[ -30,   68, -100,   21,  -70],
       [  24,  -64,   -6,  -11,  -86],
       [  59,   61,   43,   70,  -73],
       [ -22,  -31,   47,   76,  -64]])

In [13]:
df = pd.DataFrame(data,index,columns)

In [77]:
df

    W    E   R   T  new columns
A  68 -100  21 -70           38
B -64   -6 -11 -86          -40
C  61   43  70 -73          120
D -31   47  76 -64          -53

In [16]:
type(df)

pandas.core.frame.DataFrame

In [82]:
df['W']

A    68
B   -64
C    61
D   -31
Name: W, dtype: int32

In [83]:
df[['W','new columns']]

    W  new columns
A  68           38
B -64          -40
C  61          120
D -31          -53

In [33]:
type(df['Q'])

pandas.core.series.Series

In [35]:
df['new columns'] = df['Q'] + df["W"]

In [36]:
df

    Q   W    E   R   T  new columns
A -30  68 -100  21 -70           38
B  24 -64   -6 -11 -86          -40
C  59  61   43  70 -73          120
D -22 -31   47  76 -64          -53

In [38]:
df.drop('Q', axis = 1)

    W    E   R   T  new columns
A  68 -100  21 -70           38
B -64   -6 -11 -86          -40
C  61   43  70 -73          120
D -31   47  76 -64          -53

In [40]:
df

    Q   W    E   R   T  new columns
A -30  68 -100  21 -70           38
B  24 -64   -6 -11 -86          -40
C  59  61   43  70 -73          120
D -22 -31   47  76 -64          -53

In [41]:
df = df.drop('Q',axis=1)

In [42]:
df

    W    E   R   T  new columns
A  68 -100  21 -70           38
B -64   -6 -11 -86          -40
C  61   43  70 -73          120
D -31   47  76 -64          -53

In [44]:
df.loc['A']

W               68
E             -100
R               21
T              -70
new columns     38
Name: A, dtype: int32

In [51]:
type(df.loc[['A','B']])

pandas.core.frame.DataFrame

In [53]:
df.loc[["A","B"]]

    W    E   R   T  new columns
A  68 -100  21 -70           38
B -64   -6 -11 -86          -40

In [56]:
df_new = df.drop('A')

In [58]:
df_new

    W   E   R   T  new columns
B -64  -6 -11 -86          -40
C  61  43  70 -73          120
D -31  47  76 -64          -53

In [67]:
df.iloc[0:2,2:]

    R   T  new columns
A  21 -70           38
B -11 -86          -40

In [71]:
df.loc[['A','B'],['W','new columns']]

    W  new columns
A  68           38
B -64          -40